uhnp/src/Documents/РеестрПлатежей/РеестрПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрПлатежей</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеМаршрута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаявкиНаОплату</name>
    <attributes>
      <name>Исключена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаОплату</name>
      <type>
        <types>DefinedType.ДокументыРеестраПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПлатежа</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>DefinedType.Договор</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>210</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КтоИсключил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИсключения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетКасса</name>
      <type>
        <types>DefinedType.БанковскийСчетКасса</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНарушения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>CatalogRef.ПриоритетыПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/РазмещениеЗаявок/РазмещениеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеЗаявок</name>
  <resources>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.АналитикаПланированияКонтрагент</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияДаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаОплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияБанковскогоСчетаКассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретРазбиенияСлияния</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВстречнойПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </resources>
  <resources>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияКурсаПлатежа</name>
    <type>
      <types>EnumRef.СпособыОпределенияКурсаПлатежа</types>
    </type>
  </resources>
  <resources>
    <name>ДатаФиксацииКурсаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СдвигДатыФиксацииКурсаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсУстановленВЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаОперацию</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/РегистрСостоянийОбъектов/РегистрСостоянийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрСостоянийОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеОбъекта</name>
    <type>
      <types>EnumRef.СостоянияИнцидентов</types>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СостоянияМероприятий</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>CatalogRef.СостоянияСогласования</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостоянияИсполненияДокументовПланирования/СостоянияИсполненияДокументовПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияИсполненияДокументовПланирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеИсполнения</name>
    <type>
      <types>EnumRef.СостоянияИсполненияЗаявки</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИзменившийСостояние</name>
    <type>
      <types>DefinedType.ДокументыИзменяющиеСостояниеДокументовПланирования</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПланирования</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЗаявкиВРеестрахПлатежей/ЗаявкиВРеестрахПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиВРеестрахПлатежей</name>
  <resources>
    <name>РеестрПлатежей</name>
    <type>
      <types>DocumentRef.РеестрПлатежей</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаОперацию</name>
    <type>
      <types>DefinedType.ДокументыРеестраПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормыОплаты</name>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>БонусныеБаллы</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияИсполненияЗаявки/СостоянияИсполненияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияИсполненияЗаявки</name>
  <enumValues>
    <name>НеОбработана</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВРеестрПлатежей</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/РеестрПлатежей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СтандартныеПодсистемыКоманды

// Заполняет список команд создания на основании.
// 
// Параметры:
// 	КомандыСозданияНаОсновании - ТаблицаЗначений - перечень команд
// 	Параметры - Структура - параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

#КонецОбласти

Функция СписокСогласованныхПлатежей(Знач Организация, Знач ДатаОплаты, ВыбранныеИдентификаторы = Неопределено, ИсключаемыеИдентификаторы = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
	|	РазмещениеЗаявок.Контрагент КАК Контрагент,
	|	РазмещениеЗаявок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	РазмещениеЗаявок.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	РазмещениеЗаявок.Сумма КАК СуммаПлатежа,
	|	РазмещениеЗаявок.ВалютаОплаты КАК ВалютаПлатежа,
	|	РазмещениеЗаявок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РазмещениеЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_ДокументыДляВключенияВРеестр
	|ИЗ
	|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|ГДЕ
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.Проведен
	|	И РазмещениеЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	И РазмещениеЗаявок.Организация = &Организация
	|	И РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|	И РазмещениеЗаявок.ДатаИсполнения = &ДатаИсполнения
	|	И НЕ РазмещениеЗаявок.БанковскийСчетКасса В (&ПустойСчет)
	|	И РазмещениеЗаявок.ИдентификаторПозиции В(&ВыбранныеИдентификаторыПозиций)
	|	И НЕ РазмещениеЗаявок.ИдентификаторПозиции В (&ИсключаемыеИдентификаторыПозиций)
	|	И НЕ РазмещениеЗаявок.БезакцептноеСписание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОплату,
	|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	РазмещениеЗаявок.СуммаПлатежа КАК СуммаПлатежа,
	|	РазмещениеЗаявок.ВалютаПлатежа КАК ВалютаПлатежа,
	|	РазмещениеЗаявок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РазмещениеЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(СостоянияИсполнения.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.ПустаяСсылка)) КАК СостояниеИсполнения,
	|	ЛОЖЬ КАК Исполнение,
	|	ВЫБОР
	|		КОГДА РазмещениеЗаявок.Контрагент = НЕОПРЕДЕЛЕНО
	|				ИЛИ РазмещениеЗаявок.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ИЛИ РазмещениеЗаявок.Контрагент = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА РазмещениеЗаявок.ЗаявкаНаОперацию.Контрагент
	|		ИНАЧЕ РазмещениеЗаявок.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ЕСТЬNULL(РазмещениеЗаявок.ЗаявкаНаОперацию.ЦФО, РазмещениеЗаявок.ЗаявкаНаОперацию.ОсновнойЦФО) КАК ЦФО, 
	// ЕРПУХ ++
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РазмещениеЗаявок.ЗаявкаНаОперацию.ДоговорКонтрагента, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|			ТОГДА РазмещениеЗаявок.ДоговорКонтрагента
	|		ИНАЧЕ РазмещениеЗаявок.ЗаявкаНаОперацию.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	// ЕРПУХ --
	|	ЕСТЬNULL(&РеквизитОтветственный, РазмещениеЗаявок.ЗаявкаНаОперацию.Ответственный) КАК Ответственный,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.НазначениеПлатежа КАК НазначениеПлатежа,
	|	РазмещениеЗаявок.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.ЕстьПревышениеЛимитов КАК ЕстьНарушения,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.Комментарий КАК Комментарий,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию.Приоритет КАК Приоритет
	|ИЗ
	|	ВТ_ДокументыДляВключенияВРеестр КАК РазмещениеЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = РегистрСостоянийОбъектовСрезПоследних.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполнения
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = СостоянияИсполнения.ДокументПланирования
	|			И РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполнения.ИдентификаторПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВРеестрахПлатежей КАК ЗаявкиВРеестрахПлатежей
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию
	|			И РазмещениеЗаявок.ИдентификаторПозиции = ЗаявкиВРеестрахПлатежей.ИдентификаторПозиции
	|ГДЕ
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
	|	И ЗаявкиВРеестрахПлатежей.РеестрПлатежей ЕСТЬ NULL
	|	И ЕСТЬNULL(СостоянияИсполнения.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)) = ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)";
	
	Если ВыбранныеИдентификаторы <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВыбранныеИдентификаторыПозиций", ВыбранныеИдентификаторы);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"РазмещениеЗаявок.ИдентификаторПозиции В(&ВыбранныеИдентификаторыПозиций)", 
			"Истина");
	КонецЕсли;
	
	Если ИсключаемыеИдентификаторы <> Неопределено Тогда
		Запрос.УстановитьПараметр("ИсключаемыеИдентификаторыПозиций", ИсключаемыеИдентификаторы);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"НЕ РазмещениеЗаявок.ИдентификаторПозиции В (&ИсключаемыеИдентификаторыПозиций)", 
			"Истина");
	КонецЕсли;
	
	//
	Инфо = ЗаявкиНаОперации.РеквизитыДокументаЗаявка(Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитОтветственный", 
		"РазмещениеЗаявок.ЗаявкаНаОперацию." + Инфо.Ответственный.ИмяРеквизита);
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ДатаИсполнения", ДатаОплаты);
	Запрос.УстановитьПараметр("ПустойСчет", 	ВернутьМассивПустыхСчетов());
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ОрганизацииПлатежей(ДатаОплаты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
	|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	РазмещениеЗаявок.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДокументыДляВключенияВРеестр
	|ИЗ
	|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|ГДЕ
	|	РазмещениеЗаявок.Проведен
	|	И РазмещениеЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	И РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|	И РазмещениеЗаявок.ДатаИсполнения = &ДатаИсполнения
	|	И НЕ РазмещениеЗаявок.БанковскийСчетКасса В (&ПустойСчет)
	|	И НЕ РазмещениеЗаявок.БезакцептноеСписание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеЗаявок.ЗаявкаНаОперацию) КАК КоличествоЗаявок,
	|	РазмещениеЗаявок.Организация КАК Организация
	|ИЗ
	|	ВТ_ДокументыДляВключенияВРеестр КАК РазмещениеЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = РегистрСостоянийОбъектовСрезПоследних.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполнения
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = СостоянияИсполнения.ДокументПланирования
	|			И РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполнения.ИдентификаторПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВРеестрахПлатежей КАК ЗаявкиВРеестрахПлатежей
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию
	|			И РазмещениеЗаявок.ИдентификаторПозиции = ЗаявкиВРеестрахПлатежей.ИдентификаторПозиции
	|ГДЕ
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
	|	И ЗаявкиВРеестрахПлатежей.РеестрПлатежей ЕСТЬ NULL
	|	И ЕСТЬNULL(СостоянияИсполнения.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)) = ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаявок.Организация";
	
	Запрос.УстановитьПараметр("ДатаИсполнения", ДатаОплаты);
	Запрос.УстановитьПараметр("ПустойСчет", 	ВернутьМассивПустыхСчетов());
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

// Получает список необработанных платежей
//
// Параметры:
//  Дата  - Дата - начало даты исполнения отбираемых заявок 
// Возвращаемое значение:
//  Массив    - список дат исполнения заявок, подходящих под условия
//
Функция ДатыНеобработанныхПлатежей(Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
	|	РазмещениеЗаявок.ДатаИсполнения КАК ДатаИсполнения
	|ПОМЕСТИТЬ ВТ_ДокументыДляВключенияВРеестр
	|ИЗ
	|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|ГДЕ
	|	РазмещениеЗаявок.Проведен
	|	И РазмещениеЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|	И РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|	И НЕ РазмещениеЗаявок.БанковскийСчетКасса В (&ПустойСчет)
	|	И (НЕ РазмещениеЗаявок.БезакцептноеСписание)
	|	И РазмещениеЗаявок.ДатаИсполнения >= &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеЗаявок.ДатаИсполнения КАК ДатаИсполнения
	|ИЗ
	|	ВТ_ДокументыДляВключенияВРеестр КАК РазмещениеЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = РегистрСостоянийОбъектовСрезПоследних.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполнения
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = СостоянияИсполнения.ДокументПланирования
	|			И РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполнения.ИдентификаторПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВРеестрахПлатежей КАК ЗаявкиВРеестрахПлатежей
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию
	|			И РазмещениеЗаявок.ИдентификаторПозиции = ЗаявкиВРеестрахПлатежей.ИдентификаторПозиции
	|ГДЕ
	|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
	|	И ЗаявкиВРеестрахПлатежей.РеестрПлатежей ЕСТЬ NULL
	|	И ЕСТЬNULL(СостоянияИсполнения.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)) = ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаявок.ДатаИсполнения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИсполнения";
	
	Запрос.УстановитьПараметр("ПустойСчет", ВернутьМассивПустыхСчетов());
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДопУсловие","РазмещениеЗаявок.ДатаИсполнения >= &Дата"); 
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДопУсловие","ИСТИНА"); 
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	Возврат Результат.ВыгрузитьКолонку("ДатаИсполнения");	
	
КонецФункции

Функция ТаблицаЗаявокРеестра(РеестрСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
	|	ЗаявкиВРеестрахПлатежей.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	РазмещениеЗаявок.Сумма КАК Сумма,
	|	РазмещениеЗаявок.ВалютаОплаты КАК Валюта,
	|	ЕСТЬNULL(СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)) КАК СостояниеИсполнения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)) В (ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НаИсполнении), ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.Исполнена))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Исполнение,
	|	ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию.Контрагент КАК Контрагент,
	|	ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию.ЦФО КАК ЦФО
	|ИЗ
	|	РегистрСведений.ЗаявкиВРеестрахПлатежей КАК ЗаявкиВРеестрахПлатежей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполненияДокументовПланированияСрезПоследних
	|			ПО РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполненияДокументовПланированияСрезПоследних.ИдентификаторПозиции
	|				И РазмещениеЗаявок.ЗаявкаНаОперацию = СостоянияИсполненияДокументовПланированияСрезПоследних.ДокументПланирования
	|		ПО ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию = РазмещениеЗаявок.ЗаявкаНаОперацию
	|			И ЗаявкиВРеестрахПлатежей.ИдентификаторПозиции = РазмещениеЗаявок.ИдентификаторПозиции
	|ГДЕ
	|	ЗаявкиВРеестрахПлатежей.РеестрПлатежей = &РеестрПлатежей";
	
	ИмяРеквизитаДоговор = ЗаявкиНаОперации.ИмяРеквизитаДоговорДокумента(
							Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка());
							
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаявкаНаОперацию.ДоговорКонтрагента", "ЗаявкаНаОперацию." + ИмяРеквизитаДоговор);
	
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрСсылка);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//По значениям ДокументПланированияВход и ИдентификаторПозицииВход возвращает ссылку на сформированное
//платежное поручение. Когда платежное поручение не найдено - возвращает пустую ссылку
Функция ПолучитьПлатежноеПоручениеПоПлатежнойПозиции(ДокументПланированияВход, ИдентификаторПозицииВход) Экспорт
	Возврат ДенежныеСредстваВстраиваниеУХ.ПолучитьПлатежноеПоручениеПоПлатежнойПозиции(ДокументПланированияВход, ИдентификаторПозицииВход);
КонецФункции

Функция ИсполненныеЗаявкиПоРеестру(РеестрПлатежей) Экспорт
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	ЗаявкиРеестра.ЗаявкаНаОплату КАК Заявка,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкиРеестра.ЗаявкаНаОплату) КАК ЗаявкаПредставление,
	|	МИНИМУМ(ЗаявкиРеестра.НомерСтроки) КАК НомерСтроки,
	|	СостоянияИсполненияДокументов.СостояниеИсполнения КАК СостояниеИсполнения
	|ИЗ
	|	Документ.РеестрПлатежей.ЗаявкиНаОплату КАК ЗаявкиРеестра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполненияДокументов
	|		ПО ЗаявкиРеестра.ЗаявкаНаОплату = СостоянияИсполненияДокументов.ДокументПланирования
	|			И ЗаявкиРеестра.ИдентификаторПозиции = СостоянияИсполненияДокументов.ИдентификаторПозиции
	|			И (СостоянияИсполненияДокументов.СостояниеИсполнения В (&СостоянияВыполняется))
	|ГДЕ
	|	ЗаявкиРеестра.Ссылка = &РеестрПлатежей
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкиРеестра.ЗаявкаНаОплату,
	|	СостоянияИсполненияДокументов.СостояниеИсполнения";
	
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	
	СостоянияВыполняется = Новый Массив;
	СостоянияВыполняется.Добавить(Перечисления.СостоянияИсполненияЗаявки.НаИсполнении);
	СостоянияВыполняется.Добавить(Перечисления.СостоянияИсполненияЗаявки.Исполнена);
	Запрос.УстановитьПараметр("СостоянияВыполняется", СостоянияВыполняется);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СоздатьПлатежныеПорученияПоРееструУтвержденному(МассивИдентификаторов) Экспорт
	
	Для Каждого СтрокаМассив Из МассивИдентификаторов Цикл
		
		Попытка
			СоздаваемыйДокумент = Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент(); 
			СоздаваемыйДокумент.ДополнительныеСвойства.Вставить("ВызовИзРеестраПлатежей", 	Истина);
			МассивОснование = Новый Массив;
			МассивОснование.Добавить(СтрокаМассив.ЗаявкаНаОплату);
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("БанковскийСчетКасса",						 СтрокаМассив.БанковскийСчетКасса);
			СтруктураЗаполнения.Вставить("ДокументОснование",						 МассивОснование);
			СтруктураЗаполнения.Вставить("ИдентификаторПозиции",					 СтрокаМассив.Идентификатор);
			СтруктураЗаполнения.Вставить("НесколькоЗаявокНаРасходованиеСредств",	 Ложь);
			СтруктураЗаполнения.Вставить("Сумма",									 СтрокаМассив.СуммаПлатежа);
			СоздаваемыйДокумент.Заполнить(СтруктураЗаполнения); 
			Если Не ЗначениеЗаполнено(СоздаваемыйДокумент.НазначениеПлатежа) Тогда
				ДенежныеСредстваСервер.ЗаполнитьТекстНазначенияПлатежа(СоздаваемыйДокумент);  
			КонецЕсли;
       		СоздаваемыйДокумент.Дата 	= СтрокаМассив.ДатаОплаты;
			СоздаваемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);

		Исключение
			ТекстСообщения 	= НСтр("ru = 'При создании документа на основании заявки %1 произошли ошибки: %2, документ пропущен'");
			СтрОшибка 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(СтрокаМассив.ЗаявкаНаОплату), ОписаниеОшибки());
			ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрОшибка);
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура СоздатьРеестрыПлатежейПоОрганизациям() Экспорт
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
		|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
		|	РазмещениеЗаявок.Сумма КАК СуммаПлатежа,
		|	РазмещениеЗаявок.ВалютаОплаты КАК ВалютаПлатежа,
		|	РазмещениеЗаявок.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	РазмещениеЗаявок.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ДокументыДляВключенияВРеестр
		|ИЗ
		|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
		|ГДЕ
		|	РазмещениеЗаявок.Проведен
		|	И РазмещениеЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|	И РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
		|	И РазмещениеЗаявок.ДатаИсполнения = &ДатаИсполнения
		|	И НЕ РазмещениеЗаявок.БанковскийСчетКасса В (&ПустойСчет)
		|	И НЕ РазмещениеЗаявок.БезакцептноеСписание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОплату,
		|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
		|	РазмещениеЗаявок.СуммаПлатежа КАК СуммаПлатежа,
		|	РазмещениеЗаявок.ВалютаПлатежа КАК ВалютаПлатежа,
		|	ЕСТЬNULL(СостоянияИсполнения.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.ПустаяСсылка)) КАК СостояниеИсполнения,
		|	ЛОЖЬ КАК Исполнение,
		|	РазмещениеЗаявок.ЗаявкаНаОперацию.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(РазмещениеЗаявок.ЗаявкаНаОперацию.ЦФО, РазмещениеЗаявок.ЗаявкаНаОперацию.ОсновнойЦФО) КАК ЦФО,
		|	ЕСТЬNULL(&РеквизитДоговорКонтрагента, РазмещениеЗаявок.ЗаявкаНаОперацию.ДоговорКонтрагента) КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(&РеквизитОтветственный, РазмещениеЗаявок.ЗаявкаНаОперацию.Ответственный) КАК Ответственный,
		|	РазмещениеЗаявок.ЗаявкаНаОперацию.НазначениеПлатежа КАК НазначениеПлатежа,
		|	РазмещениеЗаявок.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	РазмещениеЗаявок.ЗаявкаНаОперацию.ЕстьПревышениеЛимитов КАК ЕстьНарушения,
		|	РазмещениеЗаявок.ЗаявкаНаОперацию.Комментарий КАК Комментарий,
		|	РазмещениеЗаявок.ЗаявкаНаОперацию.Приоритет КАК Приоритет,
		|	РазмещениеЗаявок.Организация КАК Организация
		|ИЗ
		|	ВТ_ДокументыДляВключенияВРеестр КАК РазмещениеЗаявок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
		|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = РегистрСостоянийОбъектовСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполнения
		|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = СостоянияИсполнения.ДокументПланирования
		|			И РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполнения.ИдентификаторПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВРеестрахПлатежей КАК ЗаявкиВРеестрахПлатежей
		|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = ЗаявкиВРеестрахПлатежей.ЗаявкаНаОперацию
		|			И РазмещениеЗаявок.ИдентификаторПозиции = ЗаявкиВРеестрахПлатежей.ИдентификаторПозиции
		|ГДЕ
		|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Утверждена)
		|	И ЗаявкиВРеестрахПлатежей.РеестрПлатежей ЕСТЬ NULL
		|	И ЕСТЬNULL(СостоянияИсполнения.СостояниеИсполнения, ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)) = ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана)
		|ИТОГИ
		|	СУММА(СуммаПлатежа)
		|ПО
		|	Организация";
	
	Запрос.УстановитьПараметр("ДатаИсполнения", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ПустойСчет", 	ВернутьМассивПустыхСчетов());
	
	Инфо = ЗаявкиНаОперации.РеквизитыДокументаЗаявка(Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитДоговорКонтрагента", 
		"РазмещениеЗаявок.ЗаявкаНаОперацию." + Инфо.ДоговорКонтрагента.ИмяРеквизита);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитОтветственный", 
		"РазмещениеЗаявок.ЗаявкаНаОперацию." + Инфо.Ответственный.ИмяРеквизита);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ДокументРеестр 				= Документы.РеестрПлатежей.СоздатьДокумент();
		ДокументРеестр.Дата 		= ТекущаяДатаСеанса();
		ДокументРеестр.Организация  = ВыборкаОрганизация.Организация;
		ДокументРеестр.ДатаОплаты	= ТекущаяДатаСеанса();
		
		ВыборкаЗаявки = ВыборкаОрганизация.Выбрать();
	
		Пока ВыборкаЗаявки.Следующий() Цикл
			
			СтрокаТЧ = ДокументРеестр.ЗаявкиНаОплату.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаЗаявки);
			
		КонецЦикла;

		Попытка
		    ДокументРеестр.Записать(РежимЗаписиДокумента.Проведение);		
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаСозданияРеестраПлатежей", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));			
			Продолжить;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив пустых ссылок для определяемого типа БанковскийСчетКасса.
Функция ВернутьМассивПустыхСчетов()
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(Неопределено);
	ТипыСчета = Метаданные.ОпределяемыеТипы.БанковскийСчетКасса.Тип.Типы();
	Для Каждого ТекТипыСчета Из ТипыСчета Цикл
		ПустоеЗначение = ОбщегоНазначенияУХ.ПустоеЗначениеТипа(ТекТипыСчета);
		РезультатФункции.Добавить(ПустоеЗначение);
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		// ВернутьМассивПустыхСчетов()

//
Функция ПроверитьДатыИсполненияЗаявокРеестра(ДокументОбъект, Отказ = Ложь) Экспорт
	
	ТаблицаЗаявок 	= ДокументОбъект.ЗаявкиНаОплату.Выгрузить(,"НомерСтроки, ЗаявкаНаОплату, ИдентификаторПозиции,Исключена");
	ДатаОплаты 		= ДокументОбъект.ДатаОплаты;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаЗаявок.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗаявок.ЗаявкаНаОплату КАК ЗаявкаНаОплату,
	|	ТаблицаЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
	|	ТаблицаЗаявок.Исключена КАК Исключена
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	&ТаблицаЗаявок КАК ТаблицаЗаявок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаОплату
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заявки.НомерСтроки КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕ(РазмещениеЗаявок.ЗаявкаНаОперацию) КАК ЗаявкаНаОперациюПредставление,
	|	МИНИМУМ(РазмещениеЗаявок.ДатаИсполнения) КАК ДатаИсполнения,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|		ПО ВТ_Заявки.ЗаявкаНаОплату = РазмещениеЗаявок.ЗаявкаНаОперацию
	|			И (РазмещениеЗаявок.ПриходРасход = &Расход)
	|			И (РазмещениеЗаявок.ДатаИсполнения <> &ДатаОплатыРеестра)
	|			И ВТ_Заявки.ИдентификаторПозиции = РазмещениеЗаявок.ИдентификаторПозиции
	|			И НЕ ВТ_Заявки.Исключена
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заявки.НомерСтроки,
	|	РазмещениеЗаявок.ЗаявкаНаОперацию
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки"
	);
	Запрос.УстановитьПараметр("ТаблицаЗаявок", 		ТаблицаЗаявок);
	Запрос.УстановитьПараметр("Расход", 			Перечисления.ВидыДвиженийПриходРасход.Расход);
	Запрос.УстановитьПараметр("ДатаОплатыРеестра", 	ДатаОплаты);
	
	МассивОшибок = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрОшибка = СтрШаблон(
			НСтр("ru = '%1 - отличается дата исполнения %2 от даты оплаты реестра %3'"),
			выборка.ЗаявкаНаОперациюПредставление,
			Формат(Выборка.ДатаИсполнения, "ДЛФ=D"),
			Формат(ДатаОплаты, "ДЛФ=D"));
			
		Поле = СтрШаблон("Объект.ЗаявкиНаОплату[%1]", Формат(Выборка.НомерСтроки - 1, "ЧГ="));
		ОбщегоНазначения.СообщитьПользователю(СтрОшибка, ДокументОбъект, Поле, , Отказ);
		
	КонецЦикла;
		
КонецФункции

#КонецОбласти

#КонецЕсли
